#Область ОбработчикиСобытий
Процедура ПриНачалеРаботыСистемы() //процедура-обработчик. имеет системное имя. срабатывает в момент наступления события (запуск режима пользователя)
//Форма = Обработки.РабочееМестоРекрутера.ПолучитьФорму(Форма); 
Форма = ПолучитьФорму("Обработка.РабочееМестоРекрутера.Форма");
Форма.Открыть();
КонецПроцедуры
	
Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	//Отказ = Истина;
	//ТекстПредупреждения = "Уже уходите, " + Пользователь + "?";
КонецПроцедуры                                                             								

#КонецОбласти  