//  Код проведения для документа УтверждениеБюджета (Приход)
//В модуле документа УтверждениеБюджета в процедуре ОбработкаПроведения пропишите код, который заполнит регистр со знаком «плюс»:

//  Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Для Каждого СтрокаБюджета Из СоставБюджета Цикл
//		
//		// Создаем движение по регистру "БюджетМаркетингаHR"
//		Движение = Движения.БюджетМаркетингаHR.Добавить();
//		
//		// ВИД ДВИЖЕНИЯ: ПРИХОД (заносим деньги в бюджет)
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Период      = Дата;
//		
//		// Заполняем Измерения
//		Движение.ИсточникПривлечения = СтрокаБюджета.ИсточникПривлечения;
//		Движение.СтатьяЗатрат        = СтрокаБюджета.СтатьяЗатрат;
//		
//		// Заполняем Ресурс
//		Движение.Сумма               = СтрокаБюджета.Сумма;
//		
//	КонецЦикла;

//КонецПроцедуры

// Наличие такой структуры позволит вам построить красивый План-фактный отчет с помощью СКД.

//Данные Плана будут браться из виртуальной таблицы БюджетМаркетингаHR.Обороты (по типу движения Приход).

//Данные Факта будут браться из этой же таблицы (по типу движения Расход) ИЛИ из регистра ЗатратыНаПодбор.

//В отчете вы сможете вывести процент освоения бюджета: (Факт / План) * 100%. На защите диплома такая аналитика оценивается высшим баллом.