
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БюджетМаркетингаHR Приход
	Движения.БюджетМаркетингаHR.Записывать = Истина;
	Для Каждого ТекСтрокаСоставБюджета Из СоставБюджета Цикл
		Движение = Движения.БюджетМаркетингаHR.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ИсточникПривлечения = ТекСтрокаСоставБюджета.ИсточникПривлечения;
		Движение.СтатьяЗатрат = ТекСтрокаСоставБюджета.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаСоставБюджета.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
