
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПодбор") Тогда
		// Заполнение шапки
		ДатаОкончанияРазмещения = ДанныеЗаполнения.ДатаСрочности;
		Вакансия = ДанныеЗаполнения.Должность;
		Сумма = ДанныеЗаполнения.ЗарплатаПослеВычета;
		Организация = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Рекрутер;
		//Статус = Статусы
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыНаПодбор Приход
	Движения.ЗатратыНаПодбор.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыНаПодбор.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗатратыНаПодбор = Вакансия;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	// регистр БюджетМаркетингаHR Расход
	Движения.БюджетМаркетингаHR.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.БюджетМаркетингаHR.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ИсточникПривлечения = ТекСтрокаЗатраты.ИсточникПривлечения;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
