
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияКандидатов
	Движения.ИсторияКандидатов.Записывать = Истина;
	Движение = Движения.ИсторияКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Кандидат = Кандидат;
	Движение.Вакансия = Вакансия;
	Движение.ЭтапПодбора = ЭтапПодбора;
	Движение.Ответственный = Рекрутер;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
