// Как этот справочник сработает в коде?
//Когда рекрутер будет оформлять документ ПубликацияВакансии, платформа автоматически заполнит статью затрат из карточки источника благодаря
//простому коду в форме документа:
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

// &НаКлиенте
//Процедура ИсточникПривлеченияПриИзменении(Элемент)
//    // Автоподстановка статьи затрат из реквизитов справочника
//    Объект.СтатьяЗатрат = ПолучитьСтатьюЗатратПоУмолчанию(Объект.ИсточникПривлечения);
//КонецПроцедуры