 Процедура обработкаПроведения(Отказ, режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПоступленияДС Приход
	Движения.ПоступленияДС.Записывать = Истина;
	Движение = Движения.ПоступленияДС.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.Сумма = СуммаДоговора;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
 КонецПроцедуры
 