//При выборе Вакансии (Заявки на подбор) в форме документа, реквизиты КоличествоЗакрытыхСтавок и Ответственный должны заполняться автоматически из данных самой заявки. 

// &НаКлиенте
//Процедура ВакансияПриИзменении(Элемент)
//	
//	Если ЗначениеЗаполнено(Объект.Вакансия) Тогда
//		// Получаем данные из документа-основания через серверную функцию
//		СтруктураДанных = ПолучитьДанныеЗаявки(Объект.Vacancy);
//		
//		Объект.КоличествоЗакрытыхСтавок = СтруктураДанных.Количество;
//		Объект.Ответственный             = СтруктураДанных.Рекрутер;
//	КонецЕсли;
//	
//КонецПроцедуры

// ак этот документ сделает движения (Связь с регистрами)
//В главе ВКР, посвященной механизмам проведения, укажите, что при проведении ЗакрытиеВакансии делает два противоположных заявке движения:         

//Регистр накопления «ПланВакансий»: делает движение Расход (➖) на указанное КоличествоЗакрытыхСтавок по тем же Подразделению и Должности, которые были в заявке. Это уменьшает плановую потребность компании в сотрудниках до нуля.

//Регистр сведений «ИсторияСтатусовВакансий»: делает новую запись на текущую дату, где ресурсу Статус присваивается значение из реквизита шапки СтатусЗакрытия (например, Закрыта).
