
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	////{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВакансию") Тогда
	//	// Заполнение шапки
	//	Должность = ДанныеЗаполнения.Должность;
	//	ЗаработнаяПлата = ДанныеЗаполнения.ЗаработнаяПлата;
	//	ОписаниеВакансии = ДанныеЗаполнения.ОписаниеВакансии;
	//	Требования = ДанныеЗаполнения.ГрафикРаботы;
	//КонецЕсли;
	////}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
