
&НаКлиенте
Процедура РезультатИнтевью(ДанныеЗаполнения, СтандартнаяОбработка)  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеИнтервью") Тогда
		// Заполнение шапки
		Вакансия = ДанныеЗаполнения.Вакансия;
		Кандидат = ДанныеЗаполнения.Кандидат;
		Рекрутер = ДанныеЗаполнения.Рекрутер;
		ЭтапПодбора = ДанныеЗаполнения.ЭтапПодбора;
	КонецЕсли;     
КонецПроцедуры   


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Проверяем, что документ новый
	Если Объект.Ссылка.Пустая() Тогда
		
		// 1. Ловим и заполняем Кандидата
		Если Параметры.Свойство("ПараметрКандидат") Тогда
			Объект.Кандидат = Параметры.ПараметрКандидат;
		КонецЕсли;
		
		// 2. Ловим и заполняем Вакансию
		Если Параметры.Свойство("ПараметрВакансия") Тогда
			Объект.Вакансия = Параметры.ПараметрВакансия;
		КонецЕсли;
		
		// 3. Ловим и заполняем Рекрутера
		// (Внимание: имя слева 'Объект.Ответственный' должно точно совпадать 
		// с именем реквизита в документе РезультатИнтервью)
		Если Параметры.Свойство("ПараметрРекрутер") Тогда
			Объект.Рекрутер = Параметры.ПараметрРекрутер;    
			Объект.ЭтапПодбора = Перечисления.Статус.СобеседованиеНазначено;
		КонецЕсли;  
		
		
	КонецЕсли;	
КонецПроцедуры
