
&НаСервере
Функция ВызСервер()
	// Получаем имя текущего пользователя из системы
    ИмяПользователяИБ = ИмяПользователя();	
    // Находим ссылку в справочнике "Пользователи" по имени 
	Объект.УчетнаяЗапись = ИмяПользователяИБ; 
	//НайденнаяСсылка = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяИБ);
	//
	//// Проверка, что пользователь найден
	//Если НайденнаяСсылка.Пустая() Тогда
	//    Сообщить("Пользователь не найден в справочнике!");
	//    Возврат Справочники.Пользователи.ПустаяСсылка();
	//Иначе
	//    Возврат НайденнаяСсылка;
	//КонецЕсли;
	//
КонецФункции


&НаКлиенте
Процедура УзнатьИмяУчетнойЗаписи(Команда) 
	ВызСервер();
КонецПроцедуры
