Функция ПолучитьИмяПользователя(ИмяПользователяИБ, НайденнаяСсылка) Экспорт 
	// Получаем имя текущего пользователя из системы
    ИмяПользователяИБ = ИмяПользователя();	
    // Находим ссылку в справочнике "Пользователи" по имени
	Возврат
	//Объект.УчетнаяЗапись = ИмяПользователяИБ;  
    НайденнаяСсылка = Справочники.Сотрудники.НайтиПоНаименованию(ИмяПользователяИБ);
    
    // Проверка, что пользователь найден
    Если НайденнаяСсылка.Пустая() Тогда
        Сообщить("Пользователь не найден в справочнике!");
        Возврат Справочники.Пользователи.ПустаяСсылка();
    Иначе
        Возврат НайденнаяСсылка;
	КонецЕсли;
	
КонецФункции
