
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияКандидатов
	Движения.ИсторияКандидатов.Записывать = Истина;
	Движение = Движения.ИсторияКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Кандидат = Кандидат;
	Движение.Вакансия = Вакансия;
	Движение.ЭтапПодбора = ЭтапПодбора;
	Движение.Ответственный = Вакансия;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеИнтервью") Тогда
		// Заполнение шапки
		Вакансия = ДанныеЗаполнения.Вакансия;
		Кандидат = ДанныеЗаполнения.Кандидат;
		Рекрутер = ДанныеЗаполнения.Рекрутер;
		ЭтапПодбора = ДанныеЗаполнения.ЭтапПодбора;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
