
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗатратыНаПодбор Расход
	Движения.ЗатратыНаПодбор.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ЗатратыНаПодбор.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗатратыНаПодбор = ТекСтрокаЗатраты.Вакансия;
		Движение.СтатьяЗатрат = ТекСтрокаЗатраты.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	// регистр ПоступленияДС Расход
	Движения.ПоступленияДС.Записывать = Истина;
	Для Каждого ТекСтрокаЗатраты Из Затраты Цикл
		Движение = Движения.ПоступленияДС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договр;
		Движение.Сумма = ТекСтрокаЗатраты.Сумма;
		Движение.СписаниеСредствНаПодбор = ТекСтрокаЗатраты.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
